packages/fastify-app/src/test/stripe/charge_dispute_funds_reinstated.json

{
    "id": "evt_3KtQThJDPojXS6LN0E06aNxq",
    "object": "event",
    "api_version": "2020-03-02",
    "created": 1619701111,
    "data": {
      "object": {
        "id": "dp_1MLuxQJDPojXS6LNrukJCBBG",
        "object": "dispute",
        "amount": 1000,
        "balance_transactions": [],
        "charge": "ch_1IqtGAJDPojXS6LNstgEfUji",
        "created": 1672692608,
        "currency": "usd",
        "evidence": {
          "access_activity_log": null,
          "billing_address": null,
          "cancellation_policy": null,
          "cancellation_policy_disclosure": null,
          "cancellation_rebuttal": null,
          "customer_communication": null,
          "customer_email_address": null,
          "customer_name": null,
          "customer_purchase_ip": null,
          "customer_signature": null,
          "duplicate_charge_documentation": null,
          "duplicate_charge_explanation": null,
          "duplicate_charge_id": null,
          "product_description": null,
          "receipt": null,
          "refund_policy": null,
          "refund_policy_disclosure": null,
          "refund_refusal_explanation": null,
          "service_date": null,
          "service_documentation": null,
          "shipping_address": null,
          "shipping_carrier": null,
          "shipping_date": null,
          "shipping_documentation": null,
          "shipping_tracking_number": null,
          "uncategorized_file": null,
          "uncategorized_text": null
        },
        "evidence_details": {
          "due_by": 1674345599,
          "has_evidence": false,
          "past_due": false,
          "submission_count": 0
        },
        "is_charge_refundable": true,
        "livemode": false,
        "metadata": {},
        "payment_intent": "pi_1IqtG9JDPojXS6LNOGnYrIqq",
        "reason": "general",
        "status": "warning_needs_response"
      }
    },
    "livemode": false,
    "pending_webhooks": 4,
    "request": {
      "id": "req_QyDCzn33ls4m1t",
      "idempotency_key": null
    },
    "type": "charge.dispute.funds_reinstated"
  }
  