packages/fastify-app/src/test/stripe/charge_updated.json

{
  "id": "evt_3KtQThJDPojXS6LN0E06aNxq",
  "object": "event",
  "api_version": "2020-03-02",
  "created": 1619701111,
  "data": {
    "object": {
      "id": "ch_3KtoMeJDPojXS6LN0igeffJ6",
      "object": "charge",
      "amount": 2500,
      "amount_captured": 0,
      "amount_refunded": 0,
      "application": null,
      "application_fee": null,
      "application_fee_amount": null,
      "balance_transaction": null,
      "billing_details": {
        "address": {
          "city": null,
          "country": "ID",
          "line1": null,
          "line2": null,
          "postal_code": null,
          "state": null
        },
        "email": null,
        "name": null,
        "phone": null
      },
      "calculated_statement_descriptor": "SUPABASE",
      "captured": false,
      "created": 1651217744,
      "currency": "usd",
      "customer": "cus_J7Mkgr8mvbl1eK",
      "description": "Subscription creation",
      "destination": null,
      "dispute": null,
      "disputed": false,
      "failure_balance_transaction": null,
      "failure_code": "card_declined",
      "failure_message": "Your card does not support this type of purchase.",
      "fraud_details": {},
      "invoice": "in_1KJdKkJDPojXS6LNSwSWkZSN",
      "livemode": true,
      "metadata": {},
      "on_behalf_of": null,
      "order": null,
      "outcome": {
        "network_status": "declined_by_network",
        "reason": "transaction_not_allowed",
        "risk_level": "normal",
        "seller_message": "The bank returned the decline code `transaction_not_allowed`.",
        "type": "issuer_declined"
      },
      "paid": false,
      "payment_intent": "pi_3KtoMeJDPojXS6LN0XnGDnI3",
      "payment_method": "pm_1KtoMBJDPojXS6LNhoWgdwNI",
      "payment_method_details": {
        "card": {
          "brand": "mastercard",
          "checks": {
            "address_line1_check": null,
            "address_postal_code_check": null,
            "cvc_check": "unavailable"
          },
          "country": "SG",
          "exp_month": 2,
          "exp_year": 2027,
          "fingerprint": "rTCV95kAMSlpBpjG",
          "funding": "prepaid",
          "installments": null,
          "last4": "2003",
          "mandate": null,
          "network": "mastercard",
          "three_d_secure": null,
          "wallet": null
        },
        "type": "card"
      },
      "receipt_email": null,
      "receipt_number": null,
      "receipt_url": null,
      "refunded": false,
      "refunds": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges/ch_3KtoMeJDPojXS6LN0igeffJ6/refunds"
      },
      "review": null,
      "shipping": null,
      "source": null,
      "source_transfer": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "failed",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 4,
  "request": {
    "id": "req_QyDCzn33ls4m1t",
    "idempotency_key": null
  },
  "type": "charge.updated"
}
