packages/fastify-app/src/test/stripe/customer_updated.json

{
  "id": "evt_1IlZRsJDPojXS6LN2AbFmnR4",
  "object": "event",
  "api_version": "2020-03-02",
  "created": 1619701111,
  "data": {
    "object": {
      "id": "cus_IhGfebO16cMIGN",
      "object": "customer",
      "address": null,
      "balance": 0,
      "created": 1609763141,
      "currency": "usd",
      "default_source": null,
      "delinquent": false,
      "description": "[35 | visible-emerald-fly]: Copple Staging",
      "discount": null,
      "email": "billz@supabase.io",
      "invoice_prefix": "D78833AC",
      "invoice_settings": {
        "custom_fields": null,
        "default_payment_method": "pm_1IfHHPJDPojXS6LNltyTwn3a",
        "footer": null
      },
      "livemode": false,
      "metadata": {
        "supabase_org_id": "35"
      },
      "name": "Copple",
      "next_invoice_sequence": 61,
      "phone": "+6587498462",
      "preferred_locales": [],
      "shipping": {
        "address": {
          "city": "",
          "country": "",
          "line1": "",
          "line2": "",
          "postal_code": "",
          "state": ""
        },
        "name": "Copple",
        "phone": "+6587498462"
      },
      "sources": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/customers/cus_IhGfebO16cMIGN/sources"
      },
      "subscriptions": {},
      "tax_exempt": "none",
      "tax_ids": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/customers/cus_IhGfebO16cMIGN/tax_ids"
      }
    },
    "previous_attributes": {
      "email": "billing@supabase.io"
    }
  },
  "livemode": false,
  "pending_webhooks": 4,
  "request": {
    "id": "req_QyDCzn33ls4m1t",
    "idempotency_key": null
  },
  "type": "customer.updated"
}
